In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
##load in datasets

#1. test.csv
test = pd.read_csv('./datasets/test.csv')
test = pd.DataFrame(test)
test.head()

,Id,Date,Address,Species,Block,Street,Trap,AddressNumberAndStreet,Latitude,Longitude,AddressAccuracy
0,1,2008-06-11,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX PIPIENS/RESTUANS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.95469,-87.800991,9
1,2,2008-06-11,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX RESTUANS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.95469,-87.800991,9
2,3,2008-06-11,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX PIPIENS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.95469,-87.800991,9
3,4,2008-06-11,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX SALINARIUS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.95469,-87.800991,9
4,5,2008-06-11,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX TERRITANS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.95469,-87.800991,9

In [3]:

# Don't need to run again
##load in datasets

#1. train.csv
#wn = pd.read_csv('./datasets/train.csv')
#wn = pd.DataFrame(train)
#wn.head()

In [4]:
test.isnull().sum() #Checking for missing data

Id                        0
Date                      0
Address                   0
Species                   0
Block                     0
Street                    0
Trap                      0
AddressNumberAndStreet    0
Latitude                  0
Longitude                 0
AddressAccuracy           0
dtype: int64

In [5]:
test.info() #Checking the info of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 116293 entries, 0 to 116292
Data columns (total 11 columns):
Id                        116293 non-null int64
Date                      116293 non-null object
Address                   116293 non-null object
Species                   116293 non-null object
Block                     116293 non-null int64
Street                    116293 non-null object
Trap                      116293 non-null object
AddressNumberAndStreet    116293 non-null object
Latitude                  116293 non-null float64
Longitude                 116293 non-null float64
AddressAccuracy           116293 non-null int64
dtypes: float64(2), int64(3), object(6)
memory usage: 9.8+ MB

In [6]:
test.shape #Checking size

(116293, 11)

In [7]:
test.columns # Looking at columns

Index(['Id', 'Date', 'Address', 'Species', 'Block', 'Street', 'Trap',
       'AddressNumberAndStreet', 'Latitude', 'Longitude', 'AddressAccuracy'],
      dtype='object')

### NumMosquitos is missing here but is in the training data

In [8]:
wn = pd.read_csv('./datasets/train.csv')

In [9]:
wn.shape #Train shape

(10506, 12)

In [10]:
wn.columns #Train columns

Index(['Date', 'Address', 'Species', 'Block', 'Street', 'Trap',
       'AddressNumberAndStreet', 'Latitude', 'Longitude', 'AddressAccuracy',
       'NumMosquitos', 'WnvPresent'],
      dtype='object')

In [11]:
wn_features = ['Date','Species', 'Trap', 'Longitude', 'Latitude'] #checking out the features 
target = ['WnvPresent']

In [12]:
wn[wn_features].isna().sum() # checking for nan values

Date         0
Species      0
Trap         0
Longitude    0
Latitude     0
dtype: int64

In [13]:
test[wn_features].isna().sum() #checking for nan values

Date         0
Species      0
Trap         0
Longitude    0
Latitude     0
dtype: int64

In [14]:
wn[wn_features].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10506 entries, 0 to 10505
Data columns (total 5 columns):
Date         10506 non-null object
Species      10506 non-null object
Trap         10506 non-null object
Longitude    10506 non-null float64
Latitude     10506 non-null float64
dtypes: float64(2), object(3)
memory usage: 410.5+ KB

In [15]:
test[wn_features].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 116293 entries, 0 to 116292
Data columns (total 5 columns):
Date         116293 non-null object
Species      116293 non-null object
Trap         116293 non-null object
Longitude    116293 non-null float64
Latitude     116293 non-null float64
dtypes: float64(2), object(3)
memory usage: 4.4+ MB

In [16]:
wn.shape  #dropped duplicates

(10506, 12)

In [17]:
wn['WnvPresent'].value_counts(normalize=True) #still unbalanced classes

0    0.947554
1    0.052446
Name: WnvPresent, dtype: float64

In [18]:
west_nile_features_train = wn[wn_features]

In [19]:
west_nile_features_test = test[wn_features]

In [20]:
west_nile_features_train.to_csv('clean_train.csv', index=False)
west_nile_features_test.to_csv('clean_test.csv', index=False)

In [21]:
west_nile_features_train.head()

         Date                 Species  Trap  Longitude   Latitude
0  2007-05-29  CULEX PIPIENS/RESTUANS  T002 -87.800991  41.954690
1  2007-05-29          CULEX RESTUANS  T002 -87.800991  41.954690
2  2007-05-29          CULEX RESTUANS  T007 -87.769279  41.994991
3  2007-05-29  CULEX PIPIENS/RESTUANS  T015 -87.824812  41.974089
4  2007-05-29          CULEX RESTUANS  T015 -87.824812  41.974089

In [22]:
west_nile_features_test.head()

         Date                 Species  Trap  Longitude  Latitude
0  2008-06-11  CULEX PIPIENS/RESTUANS  T002 -87.800991  41.95469
1  2008-06-11          CULEX RESTUANS  T002 -87.800991  41.95469
2  2008-06-11           CULEX PIPIENS  T002 -87.800991  41.95469
3  2008-06-11        CULEX SALINARIUS  T002 -87.800991  41.95469
4  2008-06-11         CULEX TERRITANS  T002 -87.800991  41.95469

In [23]:
west_nile_features_test.shape

(116293, 5)

In [24]:
west_nile_features_train.shape

(10506, 5)

In [31]:
target = pd.DataFrame(wn['WnvPresent'])
target.to_csv('target.csv', index=False)